app/views/documents/show.html.erb

SELECT "tags".* FROM "tags" INNER JOIN "documents_tags" ON "tags"."id" = "documents_tags"."tag_id" WHERE "documents_tags"."document_id" = 29
---
	<div id="tags">
	<% @document.tags.each do |tag| %>