app/controllers/documents_controller.rb

SELECT "documents".* FROM "documents" WHERE "documents"."id" = ? LIMIT 1  [["id", "2"]]
---
  def show
    @document = Document.find(params[:id])

SELECT "documents".* FROM "documents" WHERE "documents"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @document = Document.find(params[:id])

SELECT "tags".* FROM "tags" WHERE "tags"."name" = 'fdsfd, fdsfd'
INSERT INTO "documents" ("content", "created_at", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "fdfd"], ["created_at", Tue, 24 Apr 2012 12:49:40 UTC +00:00], ["title", "fdfd"], ["updated_at", Tue, 24 Apr 2012 12:49:40 UTC +00:00], ["user_id", nil]]
---
  def create

    @document = Document.new(params[:document])

  	taglist = JSON.parse(params[:tags])
  	taglist.each do |tagname|
  		if tag = Tag.where(:name => tagname)
  			@document.tags << tag

SELECT "documents".* FROM "documents" WHERE "documents"."id" = ? LIMIT 1  [["id", "6"]]
---
  def update
    @document = Document.find(params[:id])